In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("http://bit.ly/drinksbycountry")
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [3]:
df.index

RangeIndex(start=0, stop=193, step=1)

In [4]:
df.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

### Both above indexes are not considered a part of the dataframe as you can see below

In [5]:
df.shape

(193, 6)

In [6]:
df.continent

0               Asia
1             Europe
2             Africa
3             Europe
4             Africa
5      North America
6      South America
7             Europe
8            Oceania
9             Europe
10            Europe
11     North America
12              Asia
13              Asia
14     North America
15            Europe
16            Europe
17     North America
18            Africa
19              Asia
20     South America
21            Europe
22            Africa
23     South America
24              Asia
25            Europe
26            Africa
27            Africa
28            Africa
29            Africa
           ...
163    South America
164           Africa
165           Europe
166           Europe
167             Asia
168             Asia
169             Asia
170           Europe
171             Asia
172           Africa
173          Oceania
174    North America
175           Africa
176             Asia
177             Asia
178          Oceania
179           Africa
180           Europe
181             Asia
182           Europe
183           Africa
184    North America
185    South America
186             Asia
187          Oceania
188    South America
189             Asia
190             Asia
191           Africa
192           Africa
Name: continent, Length: 193, dtype: object

In [7]:
df[df.continent == 'South America']

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
6,Argentina,193,25,221,8.3,South America
20,Bolivia,167,41,8,3.8,South America
23,Brazil,245,145,16,7.2,South America
35,Chile,130,124,172,7.6,South America
37,Colombia,159,76,3,4.2,South America
52,Ecuador,162,74,3,4.2,South America
72,Guyana,93,302,1,7.1,South America
132,Paraguay,213,117,74,7.3,South America
133,Peru,163,160,21,6.1,South America
163,Suriname,128,178,7,5.6,South America
185,Uruguay,115,35,220,6.6,South America
188,Venezuela,333,100,3,7.7,South America

In [8]:
df.loc[23,'beer_servings']

245

In [9]:
df.set_index('country', inplace = True)
df.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [10]:
df.shape

(193, 5)

In [11]:
df.loc['India', 'beer_servings']

9

In [12]:
df.index.name = None
df.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [13]:
df.index

Index(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua & Barbuda', 'Argentina', 'Armenia', 'Australia', 'Austria',
       ...
       'Tanzania', 'USA', 'Uruguay', 'Uzbekistan', 'Vanuatu', 'Venezuela',
       'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype='object', length=193)

In [14]:
df.index.name = 'country'
df.reset_index(inplace=True)
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [15]:
df.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [16]:
df.describe().loc['max', 'beer_servings']

376.0

In [17]:
df.continent.head()

0      Asia
1    Europe
2    Africa
3    Europe
4    Africa
Name: continent, dtype: object

### Pandas series

In [18]:
df.continent.value_counts()

Africa           53
Europe           45
Asia             44
North America    23
Oceania          16
South America    12
Name: continent, dtype: int64

In [19]:
df.continent.value_counts().index

Index(['Africa', 'Europe', 'Asia', 'North America', 'Oceania',
       'South America'],
      dtype='object')

In [20]:
df.continent.value_counts()['Africa']

53

In [21]:
df.continent.value_counts().sort_values()

South America    12
Oceania          16
North America    23
Asia             44
Europe           45
Africa           53
Name: continent, dtype: int64

In [22]:
df.continent.value_counts().sort_index()

Africa           53
Asia             44
Europe           45
North America    23
Oceania          16
South America    12
Name: continent, dtype: int64

In [23]:
people = pd.Series([3000000, 4000000], index = ['Albania', 'Algeria'], name = 'population')
people

Albania    3000000
Algeria    4000000
Name: population, dtype: int64

In [24]:
df['beer_servings'] * people

0         NaN
1         NaN
2         NaN
3         NaN
4         NaN
5         NaN
6         NaN
7         NaN
8         NaN
9         NaN
10        NaN
11        NaN
12        NaN
13        NaN
14        NaN
15        NaN
16        NaN
17        NaN
18        NaN
19        NaN
20        NaN
21        NaN
22        NaN
23        NaN
24        NaN
25        NaN
26        NaN
27        NaN
28        NaN
29        NaN
           ..
165       NaN
166       NaN
167       NaN
168       NaN
169       NaN
170       NaN
171       NaN
172       NaN
173       NaN
174       NaN
175       NaN
176       NaN
177       NaN
178       NaN
179       NaN
180       NaN
181       NaN
182       NaN
183       NaN
184       NaN
185       NaN
186       NaN
187       NaN
188       NaN
189       NaN
190       NaN
191       NaN
192       NaN
Albania   NaN
Algeria   NaN
Length: 195, dtype: float64

In [26]:
pd.concat([df, people], axis=1).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,population
0,Afghanistan,0.0,0.0,0.0,0.0,Asia,NaN
1,Albania,89.0,132.0,54.0,4.9,Europe,NaN
2,Algeria,25.0,0.0,14.0,0.7,Africa,NaN
3,Andorra,245.0,138.0,312.0,12.4,Europe,NaN
4,Angola,217.0,57.0,45.0,5.9,Africa,NaN

In [53]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zipcode']
df = pd.read_table('http://bit.ly/movieusers', sep='|', header = None, names = user_cols)
df.head()

   user_id  age gender  occupation zipcode
0        1   24      M  technician   85711
1        2   53      F       other   94043
2        3   23      M      writer   32067
3        4   24      M  technician   43537
4        5   33      F       other   15213